Tekla Open API Reference for Tekla Structures 2025
AABB Constructor
 Instantiates a new axis-aligned 3d bounding box with the maximum point initialized to the smallest possible value and the minimum point to the largest possible value.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB()
Public Sub New
See Also
Reference
AABB Class
AABB Overload
Tekla.Structures.Geometry3d Namespace